[
  {
    "version": "1.5.19",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Smart-Parking als eigener Flow und mit exakten Zeitsegmenten",
    "summary": "Die intelligente Parkplatzzuweisung startet jetzt direkt über einen eigenen Button am Floorplan. Parkplätze zeigen Belegungen nun als Uhrzeit-Segmente statt nur halb/halb oder Ganztag.",
    "items": [
      "Über dem Floorplan gibt es jetzt einen eigenen Button \"Parkplatz intelligent zuweisen\" mit separatem Dialog.",
      "Die Smart-Parking-Anfrage nutzt Startzeit, Aufenthaltsdauer und Ladezeit im eigenen Flow und bucht beim Bestätigen als genaue Zeitfenster.",
      "Parkplatz-Ringe und Tooltips verwenden jetzt dieselbe segmentierte 12h-Uhr-Logik wie Räume, damit auch geteilte Buchungen exakt sichtbar sind."
    ]
  },
  {
    "version": "1.5.18",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Smart-Parking-Buchung aktualisiert Belegung wieder korrekt",
    "summary": "Nach dem Bestätigen einer Smart-Parking-Empfehlung wird die Belegung jetzt wieder zuverlässig neu geladen, statt wegen eines internen Fehlers stehen zu bleiben.",
    "items": [
      "Die Bestätigung einer Smart-Parking-Buchung stößt nun die vorhandene Belegungs-Aktualisierung direkt an.",
      "Dadurch erscheinen neu erstellte Parkplatz-Buchungen nach dem Abschließen wieder sofort in der Ansicht.",
      "Ein TypeScript-Fehler durch einen veralteten Funktionsnamen im Buchungsflow ist damit behoben."
    ]
  },
  {
    "version": "1.5.17",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Parkplatzbuchung mit Uhrzeit und intelligenter Zuweisung",
    "summary": "Parkplätze werden jetzt mit Start- und Endzeit gebucht. Zusätzlich gibt es einen geführten Assistenten, der Ladeplätze zuerst nur für die tatsächliche Ladezeit einplant.",
    "items": [
      "Parkplätze unterstützen jetzt Uhrzeiten statt Vormittag/Nachmittag/Ganztag.",
      "Im Dialog helfen Presets beim Start (Vormittag, Nachmittag, Ganztag), die Zeiten bleiben frei anpassbar.",
      "Bei Floorplans mit Parkplatz-Default kann ein intelligenter Flow Ladezeit und Aufenthaltsdauer abfragen und eine passende Kombination vorschlagen."
    ]
  },
  {
    "version": "1.5.16",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Bug-Meldungen jetzt mit Screenshot-Anhang",
    "summary": "Beim Melden eines Bugs kann jetzt direkt ein Screenshot hochgeladen werden. Admins sehen den Anhang in der Detailansicht der Meldung.",
    "items": [
      "Im Feedback-Dialog für Bug-Meldungen gibt es jetzt einen optionalen Screenshot-Upload mit Vorschau.",
      "Der Screenshot wird zusammen mit der Meldung sicher gespeichert und der Meldung zugeordnet.",
      "Im Admin-Bereich zeigt die Detailansicht den Screenshot an und öffnet ihn bei Bedarf in voller Größe."
    ]
  },
  {
    "version": "1.5.15",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Feedback-Formular lässt sich wieder zuverlässig absenden",
    "summary": "Der Button im Dialog für Feature Requests und Bugmeldungen ist nicht mehr vorzeitig gesperrt, sodass Meldungen wieder normal abgeschickt werden können.",
    "items": [
      "Der Button \"Meldung absenden\" bleibt nur noch während des tatsächlichen Sendens deaktiviert.",
      "Ist die Beschreibung zu kurz, gibt die App wie bisher eine klare Hinweis-Meldung aus statt den Button dauerhaft ausgegraut zu lassen.",
      "Damit können Nutzer das Formular wieder direkt bedienen und ihre Meldung ohne Umweg abschicken."
    ]
  },
  {
    "version": "1.5.14",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Admin kann Neu-Anmeldung für alle Mitarbeitenden erzwingen",
    "summary": "Im Menüpunkt Mitarbeiter gibt es jetzt eine zentrale Aktion, um alle aktiven Sitzungen graceful zu beenden und eine klare Re-Login-Meldung anzuzeigen.",
    "items": [
      "Im Bereich Mitarbeiter steht eine neue Aktion \"Neu anmelden erzwingen\" inklusive Sicherheitsabfrage zur Verfügung.",
      "Nach dem Auslösen müssen sich alle Mitarbeitenden bei ihrem nächsten API-Aufruf neu anmelden.",
      "Betroffene Nutzer sehen auf der Login-Seite den Hinweis, dass ihre Sitzung wegen eines Updates beendet wurde."
    ]
  },
  {
    "version": "1.5.13",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Feedback-Button jetzt prominenter unter dem Kalender",
    "summary": "Der Button für Feature Requests und Bug-Meldungen steht jetzt als eigener Bereich unter \"Datum & Ansicht\" und nutzt die primäre blaue Button-Farbe.",
    "items": [
      "Der Button \"Feature Request / Bug melden\" wurde aus der Karte \"Datum & Ansicht\" herausgelöst und separat darunter platziert.",
      "Zwischen Kalenderbereich und Feedback-Button wurde zusätzlicher Abstand eingefügt, damit der Bereich klarer getrennt ist.",
      "Der Feedback-Button verwendet jetzt den primären blauen Button-Stil wie die übrigen Hauptaktionen."
    ]
  },
  {
    "version": "1.5.12",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Kontaktaktionen in Profilkarten jetzt auch bei fremden Mandanten",
    "summary": "In Profilkarten von belegten Ressourcen sind Anrufen, Email und Chat jetzt auch dann verfügbar, wenn die Buchung aus einem anderen Mandanten stammt.",
    "items": [
      "Profilkarten mit Fremdbuchungen zeigen die Kontaktbuttons jetzt unabhängig davon, ob die Ressource für den eigenen Mandanten buchbar ist.",
      "Damit bleiben Anrufen, Email und Chat auf jeder Personenkarte konsistent verfügbar.",
      "Die reine Buchungslogik bleibt unverändert: Nicht buchbare Ressourcen können weiterhin nicht vom eigenen Mandanten gebucht werden."
    ]
  },
  {
    "version": "1.5.11",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Profilkarten in Anwesenheitsliste jetzt auch tenant-übergreifend",
    "summary": "Im rechten Anwesenheits-Panel lassen sich Profilkarten jetzt auch dann öffnen, wenn die Person aus einem anderen Mandanten auf derselben Fläche gebucht ist.",
    "items": [
      "Ein Klick auf Personen in der Anwesenheitsliste öffnet die Profilkarte jetzt auch bei Buchungen aus anderen Mandanten auf dem gleichen Floor.",
      "Die bisherige Sperre für nicht buchbare Ressourcen gilt weiterhin im Floorplan, nicht aber beim reinen Öffnen der Profilansicht aus der Anwesenheitsliste.",
      "Enter und Leertaste unterstützen dieses Verhalten ebenfalls für die Tastaturbedienung."
    ]
  },
  {
    "version": "1.5.10",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Anwesenheitsliste öffnet jetzt direkt die Profilkarte",
    "summary": "Personen im rechten Anwesenheits-Panel können jetzt direkt angeklickt werden, um die bestehende Profilkarte der Buchung zu öffnen.",
    "items": [
      "Ein Klick auf einen Eintrag in der Anwesenheitsliste öffnet jetzt dieselbe Profilkarte wie bei der Auswahl über den Floorplan.",
      "Die Liste unterstützt zusätzlich Tastaturbedienung: Enter und Leertaste öffnen die Profilkarte für den markierten Eintrag.",
      "Aktive Einträge bleiben visuell markiert, damit Auswahl und Kontext im Floorplan sofort erkennbar sind."
    ]
  },
  {
    "version": "1.5.9",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Fremd-Buchungsprofil mit E-Mail- und Teams-Chat-Aktionen",
    "summary": "In der Profilkarte einer fremden Buchung gibt es jetzt neben Anrufen auch direkte Aktionen für E-Mail und Teams-Chat.",
    "items": [
      "Im Info-Fenster fremder Buchungen stehen jetzt drei gleichwertige Kontakt-Buttons: Anrufen, Email und Chat.",
      "Der neue Email-Button öffnet das Standard-Mailprogramm direkt mit gesetztem Empfänger.",
      "Der neue Chat-Button startet einen Teams-Chat über Deep-Link mit der ausgewählten Person.",
      "Wenn keine E-Mail hinterlegt ist, sind Email und Chat deaktiviert und zeigen den Hinweis 'Keine E-Mail hinterlegt'."
    ]
  },
  {
    "version": "1.5.8",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Entra-Telefon-Sync bevorzugt jetzt Festnetz vor Mobil",
    "summary": "Beim Login und Profil-Refresh wird für Mitarbeitende jetzt zuerst die geschäftliche Telefonnummer übernommen; Mobil wird nur noch als Fallback genutzt.",
    "items": [
      "Wenn in Entra sowohl businessPhones als auch mobilePhone vorhanden sind, wird jetzt konsequent businessPhones[0] gespeichert.",
      "Sind mehrere geschäftliche Nummern vorhanden, wird ohne zusätzliche Auswahl immer der erste Eintrag verwendet.",
      "Wenn keine geschäftliche Nummer vorhanden ist, nutzt der Sync weiterhin mobilePhone als Fallback.",
      "Liefert Entra keine Telefonnummer, bleibt der bestehende Wert im Mitarbeiterprofil unverändert statt geleert zu werden."
    ]
  },
  {
    "version": "1.5.7",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Entra-Refresh meldet Graph-Berechtigungsfehler klar und verhindert falsche Erfolgsmeldungen",
    "summary": "Der Mitarbeiter-Refresh zeigt jetzt echte Graph-Fehler inklusive Berechtigungshinweis an und meldet Erfolg nur noch bei tatsächlichem Datenbank-Write.",
    "items": [
      "Beim Profil-Refresh werden Graph-Fehler mit Status, Fehlercode und Klartext erfasst, damit Berechtigungsprobleme sofort erkennbar sind.",
      "Fehlt für /users der Admin-Consent auf User.Read.All, zeigt die Oberfläche eine klare Fehlermeldung statt eines stillen Erfolgs.",
      "Der Refresh nutzt in app_users zuerst die Entra-Object-ID und nur sonst die E-Mail, damit der richtige Nutzer in Graph gelesen wird.",
      "Ein Erfolgshinweis erscheint nur noch, wenn die Profildaten wirklich in der Datenbank gespeichert wurden."
    ]
  },
  {
    "version": "1.5.6",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Mitarbeiter-Refresh zeigt Telefonstatus sofort und transparent",
    "summary": "Nach dem Entra-Refresh werden Telefonnummern sofort sichtbar aktualisiert; bei fehlenden Graph-Telefonfeldern gibt es jetzt einen klaren Hinweis statt stillem Erfolg.",
    "items": [
      "Der Admin-Refresh liefert jetzt direkte Sync-Infos mit Quelle (me/users) und Grund, falls keine Telefonnummer übernommen wurde.",
      "In der Mitarbeiterliste wird die Telefonnummer explizit angezeigt und nach Refresh sofort aus der API-Response ersetzt.",
      "Wenn Entra keine mobilePhone/businessPhones liefert, erscheint zusätzlich ein Hinweis-Toast.",
      "Server-Logs enthalten pro Refresh strukturierte Felder zu Quelle, Telefonfeldern und Ergebnis der Datenbank-Aktualisierung."
    ]
  },
  {
    "version": "1.5.5",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Admin-Status-Badges nutzen jetzt strikt erlaubte Varianten",
    "summary": "Die Variantenzuordnung im Admin-Router wurde typisiert, damit nur noch gültige Badge-Varianten genutzt werden.",
    "items": [
      "Eine neue Mapper-Funktion übersetzt eingehende Variant-Werte zuverlässig auf default, ok oder warn.",
      "Feedback-Status-Badges verwenden diese Zuordnung nun konsistent und mit sicherem Fallback auf default.",
      "Damit ist der TS2322-Typfehler im AdminRouter behoben, ohne unsichere String-Casts."
    ]
  },
  {
    "version": "1.5.4",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Neuer Admin-Bereich \"Logs\" mit Such- und Seitenfunktion",
    "summary": "Admins können System-Logs jetzt direkt im Tool einsehen, filtern und seitenweise durchgehen.",
    "items": [
      "Im Admin-Menü gibt es den neuen Punkt \"Logs\" mit einer strukturierten Log-Tabelle.",
      "Logs lassen sich nach Text durchsuchen und nach Level (Error/Warn/Info/Debug) filtern.",
      "Die Anzeige unterstützt Pagination mit einstellbarer Seitengröße und manueller Aktualisierung."
    ]
  },
  {
    "version": "1.5.3",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Feedback-Meldungen mit Status, Detailansicht und Löschfunktion",
    "summary": "Im Admin-Bereich können Feature-Requests und Bugmeldungen jetzt aktiv bearbeitet werden: mit Status, großer Detailansicht und kompletter Löschoption.",
    "items": [
      "Jede Meldung hat jetzt einen Status: In Arbeit, Abgelehnt oder Erledigt.",
      "Admins können den Status direkt in der Liste und auch im Detail-Popup ändern.",
      "Meldungen lassen sich vollständig löschen; zusätzlich gibt es eine große Detailansicht beim Klick auf einen Listeneintrag.",
      "Die Nachrichtenspalte ist breiter, damit längere Texte in der Übersicht besser lesbar sind."
    ]
  },
  {
    "version": "1.5.2",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Stornieren schützt jetzt zuverlässig fremde Halbtags-Buchungen",
    "summary": "Beim Stornieren wird nun immer nur die eigene Buchung entfernt; außerdem ist die Zeitraum-Anzeige in Profilkarten lesbarer formatiert.",
    "items": [
      "Bei geteilten Halbtags-Buchungen (AM/PM) kann ein User nicht mehr versehentlich die Buchung eines anderen Users stornieren.",
      "Die Stornierung berücksichtigt nur noch Buchungen, für die der aktuelle User wirklich berechtigt ist (Admin ausgenommen).",
      "In der Profilkarte wird der Zeitraum jetzt mit \"Zeitraum: …\" klarer dargestellt."
    ]
  },
  {
    "version": "1.5.1",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Feature-Request- und Bug-Meldungen direkt in der App",
    "summary": "User können jetzt im Buchungsbereich Feedback senden; Admins sehen alle Meldungen gesammelt mit Filtern und Datumssortierung.",
    "items": [
      "Neuer Button „Feature Request / Bug melden“ unter „Datum & Ansicht“ öffnet ein Formular mit Typ-Auswahl und Freitext.",
      "Beim Absenden wird die Meldung inklusive meldendem User in der Datenbank gespeichert.",
      "Im Admin-Menü gibt es den neuen Bereich „Feature Requests/Bug Reports“ mit Filtern nach User, Typ und Datum sowie sortierbarer Datumsliste."
    ]
  },
  {
    "version": "1.5.0",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Info-Dialog für belegte Tische mit Telefon & Teams-Anruf",
    "summary": "Belegte Tische öffnen jetzt ein reines Info-Fenster mit Profilkarten, inkl. Telefonnummer aus Entra und direkter Anruf-Option.",
    "items": [
      "Beim Klick auf einen von anderen gebuchten Tisch erscheint ein Info-Dialog ohne Buchungsaktionen.",
      "Bei geteilten Tages-Slots werden Vormittag und Nachmittag als getrennte Profilkarten nebeneinander angezeigt.",
      "Profilkarten zeigen Name, E-Mail, Telefon und ein großes Bild sowie einen „Anrufen“-Button (Teams Deep Link mit Telefon-Fallback).",
      "Die Uhrzeitvalidierung im Raumbuchungsdialog bleibt stabil und hält die Felder beim Tippen auf gleicher Position."
    ]
  },
  {
    "version": "1.4.3",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Tenant-gesperrte Tische zeigen neutralen Status-Kreis",
    "summary": "Bei nicht buchbaren Tischen wegen Tenant-Mismatch bleibt das Profilbild sichtbar, während der Status-Kreis durchgehend neutral grau angezeigt wird.",
    "items": [
      "Der Kreis von tenant-gesperrten Tischen wird nicht mehr rot oder grün dargestellt.",
      "Profilbild und Pin-Inhalt bleiben unverändert sichtbar, ohne Ausgrauen.",
      "Die Interaktion bleibt weiterhin gesperrt, aber die visuelle Kennzeichnung erfolgt nur über den grauen Status-Kreis."
    ]
  },
  {
    "version": "1.4.2",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Tenant-gesperrte Ressourcen klarer markiert",
    "summary": "Nicht buchbare Ressourcen wegen Tenant-Mismatch bleiben vollständig sichtbar; nur der Status-Kreis zeigt jetzt neutral grau den gesperrten Zustand.",
    "items": [
      "Desk-/Pin-Icon und Mitarbeiterbild werden nicht mehr ausgegraut oder transparent dargestellt.",
      "Der gesperrte Zustand wird ausschließlich über den neutral grauen Status-Kreis angezeigt.",
      "Die Buchungs-Interaktion bleibt weiterhin gesperrt, ohne visuelle Abschwächung des Inhalts im Marker."
    ]
  },
  {
    "version": "1.4.1",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Kompaktere Abstände in den Release Notes",
    "summary": "Die Karten in den Release Notes wurden visuell verdichtet, damit Version, Datum und Titel näher zusammenstehen.",
    "items": [
      "Weniger Leerraum zwischen Versionskopf und Titelbereich.",
      "Titel und Kurzbeschreibung stehen jetzt kompakter untereinander.",
      "Inhalte bleiben weiterhin klar lesbar und schnell scannbar."
    ]
  },
  {
    "version": "1.4.0",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Release Notes im Admin-Menü",
    "summary": "Admins sehen jetzt direkt im Tool, was sich in den letzten Versionen geändert hat.",
    "items": [
      "Neuer Menüpunkt \"Release Notes\" im Admin-Bereich.",
      "Wichtige Änderungen sind pro Version kompakt und verständlich beschrieben.",
      "Fokus liegt auf Features und relevanten Bugfixes statt technischen Details."
    ]
  },
  {
    "version": "1.3.0",
    "date": "2026-02-10",
    "type": "feature",
    "title": "Multi Tenant Support",
    "summary": "AVENCY Booking hat jetzt Multitenant Entra Support.",
    "items": [
      "Neuer Menüpunkt Mandanten.",
      "Pflege von Tenant ID.",
      "Auth-Flow über Universal Tenant App mit Admin/User Consent."
    ]
  }
]
