[
  {
    "version": "1.5.38",
    "date": "2026-02-19",
    "type": "feature",
    "title": "Admin-Dialog für Ressourcen wurde übersichtlich neu strukturiert",
    "summary": "Der Dialog zum Anlegen und Bearbeiten von Ressourcen ist jetzt klar in Bereiche gegliedert und deutlich schneller bedienbar – auch bei vielen Mandanten oder Mitarbeitenden.",
    "items": [
      "Grunddaten, Buchbarkeit, Mitarbeiter-Freigabe und Position sind jetzt in klar getrennten Sections mit konsistentem Layout organisiert.",
      "Mandanten- und Mitarbeiterauswahl wurden auf kompakte Such-/Mehrfachauswahl mit Chips, Alle-Auswählen und Zurücksetzen umgestellt.",
      "Aktionen liegen in einer sticky Footer-Leiste, Speichern zeigt einen stabilen Ladezustand und Pflichtfehler werden direkt inline angezeigt."
    ]
  },
  {
    "version": "1.5.37",
    "date": "2026-02-19",
    "type": "feature",
    "title": "Smart-Parking-Zeitplan ist jetzt klar in Blöcke gegliedert",
    "summary": "Parkplatznummer, Ladeplatz-Status und Zeitfenster werden im Smart-Parking jetzt als eigene visuelle Blöcke angezeigt. Dadurch ist der Zeitplan im Vorschlag und im Bestätigungsdialog deutlich schneller lesbar.",
    "items": [
      "Jede Parkplatzphase wird jetzt als eigener Block mit großer Parkplatznummer und separater Zeitzeile dargestellt.",
      "Ladeplätze zeigen statt kryptischem Kürzel ein eigenes Badge mit Blitz-Icon und der Bezeichnung \"E-Ladeplatz\".",
      "Im Bestätigungsdialog sind die einzelnen Phasen klar voneinander getrennt, damit Umpark-Wechsel leichter erkennbar sind."
    ]
  },
  {
    "version": "1.5.36",
    "date": "2026-02-19",
    "type": "bugfix",
    "title": "Backend-Build und Mitarbeiter-Freigabe im Admin repariert",
    "summary": "Der Backend-Deploy bricht nicht mehr an einer TypeScript-Prüfung ab. Außerdem zeigt die Mitarbeiter-Freigabe bei Ressourcen wieder passende Mitarbeitende an.",
    "items": [
      "Ein TypeScript-Null-Check im Floorplan-Endpunkt wurde korrigiert, damit der Backend-Build auf Render wieder erfolgreich durchläuft.",
      "Die Admin-Mitarbeiterliste liefert wieder die Mandanten-Zuordnung mit, damit Freigaben für Ressourcen korrekt gefiltert werden können.",
      "Bei \"Mitarbeiter-Freigabe: Bestimmte Mitarbeiter\" stehen im Admin-Dialog wieder auswählbare Personen zur Verfügung, statt fälschlich leer zu bleiben."
    ]
  },
  {
    "version": "1.5.35",
    "date": "2026-02-19",
    "type": "bugfix",
    "title": "Nicht freigegebene Floorplans werden im Userbereich ausgeblendet",
    "summary": "Nutzer sehen jetzt nur noch Floorplans, auf denen sie mindestens eine buchbare Ressource haben. Nicht freigegebene Bereiche können damit weder ausgewählt noch angezeigt werden.",
    "items": [
      "Die Floor-Liste im Userbereich blendet jetzt Standorte aus, für die es aufgrund der Mandanten-/Mitarbeiterfreigaben keine berechtigten Ressourcen gibt.",
      "Dadurch erscheinen keine Floorplans mehr, auf denen ein Nutzer zwar landen kann, aber nichts buchen dürfte.",
      "Admins sehen weiterhin alle Floorplans unverändert."
    ]
  },
  {
    "version": "1.5.34",
    "date": "2026-02-19",
    "type": "feature",
    "title": "Ressourcen können auf bestimmte Mitarbeitende begrenzt werden",
    "summary": "Bei jeder Ressource kann jetzt zusätzlich zum Mandanten festgelegt werden, ob alle oder nur ausgewählte Mitarbeitende buchen dürfen.",
    "items": [
      "Im Admin-Dialog für Ressourcen gibt es eine neue Mitarbeiter-Freigabe mit den Optionen \"alle\" oder \"bestimmte Mitarbeiter\".",
      "Bei einer Auswahl zeigt die Oberfläche nur Mitarbeitende aus den erlaubten Mandanten an.",
      "Bestehende Ressourcen bleiben nach dem Update standardmäßig auf \"alle Mitarbeiter\" eingestellt und funktionieren unverändert weiter."
    ]
  },
  {
    "version": "1.5.33",
    "date": "2026-02-19",
    "type": "bugfix",
    "title": "Reload zeigt keinen falschen Floor-Fehler mehr",
    "summary": "Beim Neuladen bleibt die Floor-Auswahl stabil, ohne eine irreführende \"floor not found\"-Meldung anzuzeigen.",
    "items": [
      "Die Belegungsabfrage startet jetzt erst, wenn die Floor-Liste vollständig geladen und die Auswahl gültig aufgelöst ist.",
      "Dadurch erscheinen beim Reload keine falschen Fehl-Toast-Meldungen mehr, obwohl die Floors korrekt funktionieren."
    ]
  },
  {
    "version": "1.5.32",
    "date": "2026-02-19",
    "type": "bugfix",
    "title": "Floorplan-URL bleibt stabil und Smart-Parking fragt vor dem Buchen nach",
    "summary": "Der ausgewählte Floorplan im Userbereich bleibt jetzt auch nach einem Reload auf der URL-Auswahl. Zusätzlich gibt es vor der finalen Smart-Parking-Buchung ein Bestätigungsfenster mit deutlichem Umpark-Hinweis.",
    "items": [
      "Floorplans aus der URL werden jetzt robuster aufgelöst, auch wenn die URL den Namen statt der internen ID enthält.",
      "Die URL schreibt den Floorplan jetzt in einer lesbaren Struktur aus dem Floorplan-Namen und bleibt nach dem Reload auf der gewählten Ansicht.",
      "Beim Bestätigen eines Smart-Parking-Vorschlags öffnet sich zuerst ein separates Bestätigungsfenster.",
      "Wenn ein Wechsel nötig ist, zeigt das Fenster gut sichtbar die genaue Uhrzeit zum Umparken an, bevor verbindlich gebucht wird."
    ]
  },
  {
    "version": "1.5.31",
    "date": "2026-02-19",
    "type": "bugfix",
    "title": "Smart-Parking erkennt volle Stundenfenster zuverlässiger",
    "summary": "Die intelligente Parkplatzzuweisung berücksichtigt jetzt auch freie Ladefenster innerhalb des Aufenthalts. Dadurch werden Zeiträume wie 12:00–14:00 korrekt als buchbares 2-Stunden-Fenster erkannt.",
    "items": [
      "Die Ladefenster-Suche prüft jetzt zusätzlich stündliche Startpunkte innerhalb des gesamten Aufenthalts statt nur am Anfang oder Ende.",
      "Wenn das Ladefenster in der Mitte liegt, kann die Zuweisung den Aufenthalt in mehrere zusammenhängende Abschnitte aufteilen.",
      "Freie, volle Stundenfenster werden damit in der Smart-Zuweisung zuverlässiger gefunden und vorgeschlagen."
    ]
  },
  {
    "version": "1.5.30",
    "date": "2026-02-19",
    "type": "feature",
    "title": "Floorplan-Ansicht bleibt über URL stabil",
    "summary": "Die ausgewählte Floorplan- und Overview-Ansicht wird jetzt direkt über die URL mitgeführt. Außerdem nutzt der Admin-Bereich saubere Root-Pfade wie /admin statt Hash-URLs.",
    "items": [
      "Wenn du einen Floorplan auswählst, steht die Auswahl als URL-Parameter in der Adresse und bleibt nach Reload erhalten.",
      "Die rechte Overview-Ansicht (z. B. Anwesenheit oder Räume) wird ebenfalls per URL gespeichert und nach dem Neuladen wiederhergestellt.",
      "Navigation und Admin-Bereich laufen jetzt über Root-Routen wie /admin und /admin/bookings statt über #/…-Links."
    ]
  },
  {
    "version": "1.5.29",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Storno und Parkplatz-Konflikte arbeiten jetzt nutzergenau",
    "summary": "Stornos im Benutzerbereich betreffen jetzt ausschließlich eigene Buchungen. Der Sammel-Storno auf Parkplätzen läuft als ein einzelner Backend-Request, und parallele Parkplatz-Buchungen zur gleichen Zeit werden für Mitarbeitende zuverlässig verhindert.",
    "items": [
      "Im normalen Buchungsdialog können auch Admins nur noch eigene Buchungen stornieren; fremde Buchungen bleiben dem Admin-Bereich vorbehalten.",
      "Der Button „alle stornieren“ bei mehreren Parkplatz-Buchungen sendet jetzt genau einen Request und löscht nur eigene Buchungen am gewählten Tag auf der gewählten Ressource.",
      "Für Selbst-Buchungen wird bei Parkplätzen eine Zeitkonflikt-Prüfung erzwungen: dieselbe Person kann nicht mehr zwei Parkplätze im gleichen Zeitraum halten; Gastbuchungen bleiben davon ausgenommen."
    ]
  },
  {
    "version": "1.5.28",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Admin-Parkplatzdialog nutzt Uhrzeiten und Logs sind verständlicher",
    "summary": "Im Admin-Buchungsdialog werden Parkplätze jetzt wie Räume über konkrete Uhrzeiten gebucht. Zusätzlich ersetzen Backend-Logs technische IDs für Mitarbeitende, Mandanten und Ressourcen automatisch durch lesbare E-Mail-, Domain- und Ressourcennamen.",
    "items": [
      "Bei Parkplatz-Buchungen im Admin-Dialog gibt es keine Vormittag/Nachmittag/Ganztag-Auswahl mehr, sondern nur noch Start- und Endzeit.",
      "Beim Bearbeiten älterer Parkplatz-Buchungen werden frühere Tages-Slots automatisch auf sinnvolle Uhrzeiten abgebildet.",
      "Backend-Logs schreiben employeeId als E-Mail, tenantId als Tenant-Domain und deskId als Ressourcenname, damit Ereignisse ohne Nachschlagen verständlich sind."
    ]
  },
  {
    "version": "1.5.27",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Parkplatz-Buchungsdialog zeigt alle Zeiten und storniert gesammelt",
    "summary": "Im Parkplatz-Dialog wurden die alten Tages-Presets entfernt. Eigene Zeitbuchungen werden vollständig angezeigt, und der große Storno-Button löscht jetzt alle eigenen Buchungen auf dem Parkplatz für den gewählten Tag.",
    "items": [
      "Die Preset-Auswahl Vormittag/Nachmittag/Ganztag entfällt bei Parkplätzen – die freien Zeitfenster bleiben als schnelle Auswahl erhalten.",
      "Wenn du auf einem Parkplatz mehrere Buchungen am selben Tag hast, werden sie im Buchungsfenster jetzt vollständig gelistet.",
      "Der große Storno-Button entfernt bei Parkplätzen alle deine Buchungen für diesen Tag auf dem ausgewählten Parkplatz; einzelne Zeitfenster bleiben weiter über den kleinen Storno-Button löschbar.",
      "Die Smart-Parking-Logik berücksichtigt Ladefenster jetzt auch am Ende des Aufenthalts, damit verfügbare Ladezeiten zuverlässiger gefunden werden."
    ]
  },
  {
    "version": "1.5.26",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Parkplatz-Zeitslots und Umbuchung wieder korrekt",
    "summary": "Parkplatz-Presets nutzen jetzt den vollen Buchungstag von 06:00 bis 18:00 Uhr. Beim Umbuchen auf einen anderen Parkplatz werden bestehende Parkplatz-Buchungen am selben Tag zuverlässig entfernt, bevor der neue Platz gebucht wird.",
    "items": [
      "Die Presets im Buchungsdialog sind auf 06:00–12:00 (Vormittag), 12:00–18:00 (Nachmittag) und 06:00–18:00 (Ganztag) angepasst.",
      "Bei einer Umbuchung mit Überschreiben storniert das System bestehende Parkplatz-Buchungen des Tages automatisch.",
      "Danach wird der neu gewählte Parkplatz direkt als aktuelle Buchung angelegt, ohne dass alte Parkplatzbuchungen bestehen bleiben."
    ]
  },
  {
    "version": "1.5.25",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Mandantenprüfung und Buchungs-Logs jetzt durchgängig",
    "summary": "Manuelle Buchungen prüfen den Mandanten-Kontext jetzt zuverlässig über die Zielperson. Zusätzlich werden manuelle und intelligente Buchungsflüsse mit detaillierten Gründen und Abhängigkeiten im Admin-Log protokolliert.",
    "items": [
      "Bei manuellen Buchungen wird die Buchbarkeit auch im Admin-Fall konsistent aus der gewählten Zielperson abgeleitet, nicht nur aus dem angemeldeten Admin.",
      "Auch beim Bearbeiten bestehender Buchungen wird der Tenant-Zugriff jetzt gegen den tatsächlichen Buchungs-Kontext geprüft.",
      "Für manuelle und intelligente Buchungen werden Debug-/Info-/Warn-Logs mit Request-ID, Validierungsgründen, Tenant-Kontext, Konfliktursachen und Ergebnis im Admin-Log sichtbar."
    ]
  },
  {
    "version": "1.5.24",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Smart-Parking findet wieder freie Zeitkombinationen",
    "summary": "Die intelligente Parkplatzzuweisung bewertet Konflikte jetzt konsequent über gebuchte Uhrzeiten. Dadurch werden freie Anschluss-Zeitfenster auf einem Parkplatz wieder korrekt erkannt.",
    "items": [
      "Zeitbasierte Buchungen haben bei der Konfliktprüfung Vorrang vor alten AM/PM/Ganztags-Feldern.",
      "Smart-Parking kann dadurch mehrere Buchungen pro Parkplatz am selben Tag korrekt einplanen, solange sich die Uhrzeiten nicht überschneiden.",
      "Freie Kombinationen mit Ladeplatz + Anschluss-Parkplatz werden wieder gefunden, wenn zwischen bestehenden Buchungen genug Zeit ist."
    ]
  },
  {
    "version": "1.5.23",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Manuelle Buchung respektiert Mandanten korrekt",
    "summary": "Beim direkten Klick auf eine Ressource wurden Buchungen teils fälschlich als \"für deinen Mandanten nicht buchbar\" abgelehnt. Die Mandantenprüfung nutzt nun im Admin-Fall den tatsächlich gebuchten Mitarbeiter.",
    "items": [
      "Manuelle Einzelbuchungen prüfen die Buchbarkeit jetzt mit dem Mandanten der Zielperson statt pauschal mit dem aktuell angemeldeten Admin.",
      "Damit verhalten sich manuelle Buchungen konsistent zur intelligenten Zuweisung.",
      "Fehlermeldungen wegen Mandanten-Mismatch erscheinen nur noch bei echten Berechtigungskonflikten."
    ]
  },
  {
    "version": "1.5.22",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Buchungsdialog zeigt belegte Parkplätze wieder korrekt",
    "summary": "Bei Parkplätzen mit bestehender Zeitbuchung meldet der Dialog nicht mehr fälschlich \"Heute frei\", sondern zeigt die aktuelle Belegung wie im Floorplan.",
    "items": [
      "Der Buchungsdialog nutzt für Parkplätze jetzt dieselbe Tagesbelegung wie für Räume.",
      "Bestehende Parkplatz-Buchungen werden in der Liste \"Heute belegt\" wieder angezeigt.",
      "Die Frei-/Belegt-Anzeige im Dialog ist damit konsistent zu Kreis-Status und Hover-Details im Floorplan."
    ]
  },
  {
    "version": "1.5.21",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Parkplätze berücksichtigen Zeitfenster wieder korrekt",
    "summary": "Parkplatz-Buchungen mit Uhrzeiten blockieren nicht mehr den ganzen Tag. In Detailkarten wird der gebuchte Zeitraum jetzt als Uhrzeit statt „Ganztags“ gezeigt.",
    "items": [
      "Zeitbasierte Parkplatz-Buchungen zeigen in den Karten nun den echten Zeitraum (z. B. 09:00–11:00).",
      "Beim Öffnen belegter Parkplätze wird der Zeitraum konsistent als Uhrzeit dargestellt – wie bei Zeitfenstern in Räumen.",
      "Parkplätze bleiben trotz bestehender Teilzeit-Buchung weiter buchbar, sodass zusätzliche freie Zeitfenster genutzt werden können."
    ]
  },
  {
    "version": "1.5.20",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Login-Protokolle klar nach Erfolg und Fehler getrennt",
    "summary": "Login-Ereignisse werden jetzt mit passender Log-Stufe geschrieben: erfolgreiche Anmeldungen als Info, fehlgeschlagene als Warnung.",
    "items": [
      "Fehlgeschlagene Login-Versuche wegen unbekanntem oder inaktivem Nutzer werden jetzt als Warnung protokolliert.",
      "Fehlgeschlagene Login-Versuche mit falschem Passwort werden jetzt ebenfalls als Warnung protokolliert.",
      "Erfolgreiche Logins werden explizit als Info protokolliert, damit Monitoring und Filter sauber trennen können."
    ]
  },
  {
    "version": "1.5.19",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Smart-Parking als eigener Flow und mit exakten Zeitsegmenten",
    "summary": "Die intelligente Parkplatzzuweisung startet jetzt direkt über einen eigenen Button am Floorplan. Parkplätze zeigen Belegungen nun als Uhrzeit-Segmente statt nur halb/halb oder Ganztag.",
    "items": [
      "Über dem Floorplan gibt es jetzt einen eigenen Button \"Parkplatz intelligent zuweisen\" mit separatem Dialog.",
      "Die Smart-Parking-Anfrage nutzt Startzeit, Aufenthaltsdauer und Ladezeit im eigenen Flow und bucht beim Bestätigen als genaue Zeitfenster.",
      "Parkplatz-Ringe und Tooltips verwenden jetzt dieselbe segmentierte 12h-Uhr-Logik wie Räume, damit auch geteilte Buchungen exakt sichtbar sind."
    ]
  },
  {
    "version": "1.5.18",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Smart-Parking-Buchung aktualisiert Belegung wieder korrekt",
    "summary": "Nach dem Bestätigen einer Smart-Parking-Empfehlung wird die Belegung jetzt wieder zuverlässig neu geladen, statt wegen eines internen Fehlers stehen zu bleiben.",
    "items": [
      "Die Bestätigung einer Smart-Parking-Buchung stößt nun die vorhandene Belegungs-Aktualisierung direkt an.",
      "Dadurch erscheinen neu erstellte Parkplatz-Buchungen nach dem Abschließen wieder sofort in der Ansicht.",
      "Ein TypeScript-Fehler durch einen veralteten Funktionsnamen im Buchungsflow ist damit behoben."
    ]
  },
  {
    "version": "1.5.17",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Parkplatzbuchung mit Uhrzeit und intelligenter Zuweisung",
    "summary": "Parkplätze werden jetzt mit Start- und Endzeit gebucht. Zusätzlich gibt es einen geführten Assistenten, der Ladeplätze zuerst nur für die tatsächliche Ladezeit einplant.",
    "items": [
      "Parkplätze unterstützen jetzt Uhrzeiten statt Vormittag/Nachmittag/Ganztag.",
      "Im Dialog helfen Presets beim Start (Vormittag, Nachmittag, Ganztag), die Zeiten bleiben frei anpassbar.",
      "Bei Floorplans mit Parkplatz-Default kann ein intelligenter Flow Ladezeit und Aufenthaltsdauer abfragen und eine passende Kombination vorschlagen."
    ]
  },
  {
    "version": "1.5.16",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Bug-Meldungen jetzt mit Screenshot-Anhang",
    "summary": "Beim Melden eines Bugs kann jetzt direkt ein Screenshot hochgeladen werden. Admins sehen den Anhang in der Detailansicht der Meldung.",
    "items": [
      "Im Feedback-Dialog für Bug-Meldungen gibt es jetzt einen optionalen Screenshot-Upload mit Vorschau.",
      "Der Screenshot wird zusammen mit der Meldung sicher gespeichert und der Meldung zugeordnet.",
      "Im Admin-Bereich zeigt die Detailansicht den Screenshot an und öffnet ihn bei Bedarf in voller Größe."
    ]
  },
  {
    "version": "1.5.15",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Feedback-Formular lässt sich wieder zuverlässig absenden",
    "summary": "Der Button im Dialog für Feature Requests und Bugmeldungen ist nicht mehr vorzeitig gesperrt, sodass Meldungen wieder normal abgeschickt werden können.",
    "items": [
      "Der Button \"Meldung absenden\" bleibt nur noch während des tatsächlichen Sendens deaktiviert.",
      "Ist die Beschreibung zu kurz, gibt die App wie bisher eine klare Hinweis-Meldung aus statt den Button dauerhaft ausgegraut zu lassen.",
      "Damit können Nutzer das Formular wieder direkt bedienen und ihre Meldung ohne Umweg abschicken."
    ]
  },
  {
    "version": "1.5.14",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Admin kann Neu-Anmeldung für alle Mitarbeitenden erzwingen",
    "summary": "Im Menüpunkt Mitarbeiter gibt es jetzt eine zentrale Aktion, um alle aktiven Sitzungen graceful zu beenden und eine klare Re-Login-Meldung anzuzeigen.",
    "items": [
      "Im Bereich Mitarbeiter steht eine neue Aktion \"Neu anmelden erzwingen\" inklusive Sicherheitsabfrage zur Verfügung.",
      "Nach dem Auslösen müssen sich alle Mitarbeitenden bei ihrem nächsten API-Aufruf neu anmelden.",
      "Betroffene Nutzer sehen auf der Login-Seite den Hinweis, dass ihre Sitzung wegen eines Updates beendet wurde."
    ]
  },
  {
    "version": "1.5.13",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Feedback-Button jetzt prominenter unter dem Kalender",
    "summary": "Der Button für Feature Requests und Bug-Meldungen steht jetzt als eigener Bereich unter \"Datum & Ansicht\" und nutzt die primäre blaue Button-Farbe.",
    "items": [
      "Der Button \"Feature Request / Bug melden\" wurde aus der Karte \"Datum & Ansicht\" herausgelöst und separat darunter platziert.",
      "Zwischen Kalenderbereich und Feedback-Button wurde zusätzlicher Abstand eingefügt, damit der Bereich klarer getrennt ist.",
      "Der Feedback-Button verwendet jetzt den primären blauen Button-Stil wie die übrigen Hauptaktionen."
    ]
  },
  {
    "version": "1.5.12",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Kontaktaktionen in Profilkarten jetzt auch bei fremden Mandanten",
    "summary": "In Profilkarten von belegten Ressourcen sind Anrufen, Email und Chat jetzt auch dann verfügbar, wenn die Buchung aus einem anderen Mandanten stammt.",
    "items": [
      "Profilkarten mit Fremdbuchungen zeigen die Kontaktbuttons jetzt unabhängig davon, ob die Ressource für den eigenen Mandanten buchbar ist.",
      "Damit bleiben Anrufen, Email und Chat auf jeder Personenkarte konsistent verfügbar.",
      "Die reine Buchungslogik bleibt unverändert: Nicht buchbare Ressourcen können weiterhin nicht vom eigenen Mandanten gebucht werden."
    ]
  },
  {
    "version": "1.5.11",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Profilkarten in Anwesenheitsliste jetzt auch tenant-übergreifend",
    "summary": "Im rechten Anwesenheits-Panel lassen sich Profilkarten jetzt auch dann öffnen, wenn die Person aus einem anderen Mandanten auf derselben Fläche gebucht ist.",
    "items": [
      "Ein Klick auf Personen in der Anwesenheitsliste öffnet die Profilkarte jetzt auch bei Buchungen aus anderen Mandanten auf dem gleichen Floor.",
      "Die bisherige Sperre für nicht buchbare Ressourcen gilt weiterhin im Floorplan, nicht aber beim reinen Öffnen der Profilansicht aus der Anwesenheitsliste.",
      "Enter und Leertaste unterstützen dieses Verhalten ebenfalls für die Tastaturbedienung."
    ]
  },
  {
    "version": "1.5.10",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Anwesenheitsliste öffnet jetzt direkt die Profilkarte",
    "summary": "Personen im rechten Anwesenheits-Panel können jetzt direkt angeklickt werden, um die bestehende Profilkarte der Buchung zu öffnen.",
    "items": [
      "Ein Klick auf einen Eintrag in der Anwesenheitsliste öffnet jetzt dieselbe Profilkarte wie bei der Auswahl über den Floorplan.",
      "Die Liste unterstützt zusätzlich Tastaturbedienung: Enter und Leertaste öffnen die Profilkarte für den markierten Eintrag.",
      "Aktive Einträge bleiben visuell markiert, damit Auswahl und Kontext im Floorplan sofort erkennbar sind."
    ]
  },
  {
    "version": "1.5.9",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Fremd-Buchungsprofil mit E-Mail- und Teams-Chat-Aktionen",
    "summary": "In der Profilkarte einer fremden Buchung gibt es jetzt neben Anrufen auch direkte Aktionen für E-Mail und Teams-Chat.",
    "items": [
      "Im Info-Fenster fremder Buchungen stehen jetzt drei gleichwertige Kontakt-Buttons: Anrufen, Email und Chat.",
      "Der neue Email-Button öffnet das Standard-Mailprogramm direkt mit gesetztem Empfänger.",
      "Der neue Chat-Button startet einen Teams-Chat über Deep-Link mit der ausgewählten Person.",
      "Wenn keine E-Mail hinterlegt ist, sind Email und Chat deaktiviert und zeigen den Hinweis 'Keine E-Mail hinterlegt'."
    ]
  },
  {
    "version": "1.5.8",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Entra-Telefon-Sync bevorzugt jetzt Festnetz vor Mobil",
    "summary": "Beim Login und Profil-Refresh wird für Mitarbeitende jetzt zuerst die geschäftliche Telefonnummer übernommen; Mobil wird nur noch als Fallback genutzt.",
    "items": [
      "Wenn in Entra sowohl businessPhones als auch mobilePhone vorhanden sind, wird jetzt konsequent businessPhones[0] gespeichert.",
      "Sind mehrere geschäftliche Nummern vorhanden, wird ohne zusätzliche Auswahl immer der erste Eintrag verwendet.",
      "Wenn keine geschäftliche Nummer vorhanden ist, nutzt der Sync weiterhin mobilePhone als Fallback.",
      "Liefert Entra keine Telefonnummer, bleibt der bestehende Wert im Mitarbeiterprofil unverändert statt geleert zu werden."
    ]
  },
  {
    "version": "1.5.7",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Entra-Refresh meldet Graph-Berechtigungsfehler klar und verhindert falsche Erfolgsmeldungen",
    "summary": "Der Mitarbeiter-Refresh zeigt jetzt echte Graph-Fehler inklusive Berechtigungshinweis an und meldet Erfolg nur noch bei tatsächlichem Datenbank-Write.",
    "items": [
      "Beim Profil-Refresh werden Graph-Fehler mit Status, Fehlercode und Klartext erfasst, damit Berechtigungsprobleme sofort erkennbar sind.",
      "Fehlt für /users der Admin-Consent auf User.Read.All, zeigt die Oberfläche eine klare Fehlermeldung statt eines stillen Erfolgs.",
      "Der Refresh nutzt in app_users zuerst die Entra-Object-ID und nur sonst die E-Mail, damit der richtige Nutzer in Graph gelesen wird.",
      "Ein Erfolgshinweis erscheint nur noch, wenn die Profildaten wirklich in der Datenbank gespeichert wurden."
    ]
  },
  {
    "version": "1.5.6",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Mitarbeiter-Refresh zeigt Telefonstatus sofort und transparent",
    "summary": "Nach dem Entra-Refresh werden Telefonnummern sofort sichtbar aktualisiert; bei fehlenden Graph-Telefonfeldern gibt es jetzt einen klaren Hinweis statt stillem Erfolg.",
    "items": [
      "Der Admin-Refresh liefert jetzt direkte Sync-Infos mit Quelle (me/users) und Grund, falls keine Telefonnummer übernommen wurde.",
      "In der Mitarbeiterliste wird die Telefonnummer explizit angezeigt und nach Refresh sofort aus der API-Response ersetzt.",
      "Wenn Entra keine mobilePhone/businessPhones liefert, erscheint zusätzlich ein Hinweis-Toast.",
      "Server-Logs enthalten pro Refresh strukturierte Felder zu Quelle, Telefonfeldern und Ergebnis der Datenbank-Aktualisierung."
    ]
  },
  {
    "version": "1.5.5",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Admin-Status-Badges nutzen jetzt strikt erlaubte Varianten",
    "summary": "Die Variantenzuordnung im Admin-Router wurde typisiert, damit nur noch gültige Badge-Varianten genutzt werden.",
    "items": [
      "Eine neue Mapper-Funktion übersetzt eingehende Variant-Werte zuverlässig auf default, ok oder warn.",
      "Feedback-Status-Badges verwenden diese Zuordnung nun konsistent und mit sicherem Fallback auf default.",
      "Damit ist der TS2322-Typfehler im AdminRouter behoben, ohne unsichere String-Casts."
    ]
  },
  {
    "version": "1.5.4",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Neuer Admin-Bereich \"Logs\" mit Such- und Seitenfunktion",
    "summary": "Admins können System-Logs jetzt direkt im Tool einsehen, filtern und seitenweise durchgehen.",
    "items": [
      "Im Admin-Menü gibt es den neuen Punkt \"Logs\" mit einer strukturierten Log-Tabelle.",
      "Logs lassen sich nach Text durchsuchen und nach Level (Error/Warn/Info/Debug) filtern.",
      "Die Anzeige unterstützt Pagination mit einstellbarer Seitengröße und manueller Aktualisierung."
    ]
  },
  {
    "version": "1.5.3",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Feedback-Meldungen mit Status, Detailansicht und Löschfunktion",
    "summary": "Im Admin-Bereich können Feature-Requests und Bugmeldungen jetzt aktiv bearbeitet werden: mit Status, großer Detailansicht und kompletter Löschoption.",
    "items": [
      "Jede Meldung hat jetzt einen Status: In Arbeit, Abgelehnt oder Erledigt.",
      "Admins können den Status direkt in der Liste und auch im Detail-Popup ändern.",
      "Meldungen lassen sich vollständig löschen; zusätzlich gibt es eine große Detailansicht beim Klick auf einen Listeneintrag.",
      "Die Nachrichtenspalte ist breiter, damit längere Texte in der Übersicht besser lesbar sind."
    ]
  },
  {
    "version": "1.5.2",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Stornieren schützt jetzt zuverlässig fremde Halbtags-Buchungen",
    "summary": "Beim Stornieren wird nun immer nur die eigene Buchung entfernt; außerdem ist die Zeitraum-Anzeige in Profilkarten lesbarer formatiert.",
    "items": [
      "Bei geteilten Halbtags-Buchungen (AM/PM) kann ein User nicht mehr versehentlich die Buchung eines anderen Users stornieren.",
      "Die Stornierung berücksichtigt nur noch Buchungen, für die der aktuelle User wirklich berechtigt ist (Admin ausgenommen).",
      "In der Profilkarte wird der Zeitraum jetzt mit \"Zeitraum: …\" klarer dargestellt."
    ]
  },
  {
    "version": "1.5.1",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Feature-Request- und Bug-Meldungen direkt in der App",
    "summary": "User können jetzt im Buchungsbereich Feedback senden; Admins sehen alle Meldungen gesammelt mit Filtern und Datumssortierung.",
    "items": [
      "Neuer Button „Feature Request / Bug melden“ unter „Datum & Ansicht“ öffnet ein Formular mit Typ-Auswahl und Freitext.",
      "Beim Absenden wird die Meldung inklusive meldendem User in der Datenbank gespeichert.",
      "Im Admin-Menü gibt es den neuen Bereich „Feature Requests/Bug Reports“ mit Filtern nach User, Typ und Datum sowie sortierbarer Datumsliste."
    ]
  },
  {
    "version": "1.5.0",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Info-Dialog für belegte Tische mit Telefon & Teams-Anruf",
    "summary": "Belegte Tische öffnen jetzt ein reines Info-Fenster mit Profilkarten, inkl. Telefonnummer aus Entra und direkter Anruf-Option.",
    "items": [
      "Beim Klick auf einen von anderen gebuchten Tisch erscheint ein Info-Dialog ohne Buchungsaktionen.",
      "Bei geteilten Tages-Slots werden Vormittag und Nachmittag als getrennte Profilkarten nebeneinander angezeigt.",
      "Profilkarten zeigen Name, E-Mail, Telefon und ein großes Bild sowie einen „Anrufen“-Button (Teams Deep Link mit Telefon-Fallback).",
      "Die Uhrzeitvalidierung im Raumbuchungsdialog bleibt stabil und hält die Felder beim Tippen auf gleicher Position."
    ]
  },
  {
    "version": "1.4.3",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Tenant-gesperrte Tische zeigen neutralen Status-Kreis",
    "summary": "Bei nicht buchbaren Tischen wegen Tenant-Mismatch bleibt das Profilbild sichtbar, während der Status-Kreis durchgehend neutral grau angezeigt wird.",
    "items": [
      "Der Kreis von tenant-gesperrten Tischen wird nicht mehr rot oder grün dargestellt.",
      "Profilbild und Pin-Inhalt bleiben unverändert sichtbar, ohne Ausgrauen.",
      "Die Interaktion bleibt weiterhin gesperrt, aber die visuelle Kennzeichnung erfolgt nur über den grauen Status-Kreis."
    ]
  },
  {
    "version": "1.4.2",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Tenant-gesperrte Ressourcen klarer markiert",
    "summary": "Nicht buchbare Ressourcen wegen Tenant-Mismatch bleiben vollständig sichtbar; nur der Status-Kreis zeigt jetzt neutral grau den gesperrten Zustand.",
    "items": [
      "Desk-/Pin-Icon und Mitarbeiterbild werden nicht mehr ausgegraut oder transparent dargestellt.",
      "Der gesperrte Zustand wird ausschließlich über den neutral grauen Status-Kreis angezeigt.",
      "Die Buchungs-Interaktion bleibt weiterhin gesperrt, ohne visuelle Abschwächung des Inhalts im Marker."
    ]
  },
  {
    "version": "1.4.1",
    "date": "2026-02-18",
    "type": "bugfix",
    "title": "Kompaktere Abstände in den Release Notes",
    "summary": "Die Karten in den Release Notes wurden visuell verdichtet, damit Version, Datum und Titel näher zusammenstehen.",
    "items": [
      "Weniger Leerraum zwischen Versionskopf und Titelbereich.",
      "Titel und Kurzbeschreibung stehen jetzt kompakter untereinander.",
      "Inhalte bleiben weiterhin klar lesbar und schnell scannbar."
    ]
  },
  {
    "version": "1.4.0",
    "date": "2026-02-18",
    "type": "feature",
    "title": "Release Notes im Admin-Menü",
    "summary": "Admins sehen jetzt direkt im Tool, was sich in den letzten Versionen geändert hat.",
    "items": [
      "Neuer Menüpunkt \"Release Notes\" im Admin-Bereich.",
      "Wichtige Änderungen sind pro Version kompakt und verständlich beschrieben.",
      "Fokus liegt auf Features und relevanten Bugfixes statt technischen Details."
    ]
  },
  {
    "version": "1.3.0",
    "date": "2026-02-10",
    "type": "feature",
    "title": "Multi Tenant Support",
    "summary": "AVENCY Booking hat jetzt Multitenant Entra Support.",
    "items": [
      "Neuer Menüpunkt Mandanten.",
      "Pflege von Tenant ID.",
      "Auth-Flow über Universal Tenant App mit Admin/User Consent."
    ]
  }
]
